app/Http/Controllers/Frontend/IndexController.php

select * from `banners` where (`status` = 'active' and `condition` = 'banner') order by `id` desc limit 5
select * from `categories` where (`status` = 'active' and `is_parent` = 1) order by `id` desc limit 3
---
    public function home(){
        $banners = Banner::where(["status" => "active" , "condition"=> "banner"])->orderBy("id" , "DESC")->limit("5")->get() ;
        $categories  = Category::where(["status" => "active" , "is_parent"=>1])->limit(3)->orderBy("id","DESC")->get();